# LabelingMultiSegmentWithReporting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..LabelingMultiSegmentWithReporting Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Cannot label multi-segment dimensions with reporting parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LabelingMultiSegmentWithReporting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LabelingMultiSegmentWithReporting As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LabelingMultiSegmentWithReporting {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace